app/controllers/fields_controller.rb

  def index
    @fields = Field.all
---
SELECT "fields".* FROM "fields"

  def create
    @field = Field.new(field_params)

    respond_to do |format|
      if @field.save
---
INSERT INTO "fields" ("name", "age", "gender", "designationrole", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "kumar"], ["age", 18.0], ["gender", "male"], ["designationrole", "Traine"], ["created_at", "2021-11-30 08:39:24.834604"], ["updated_at", "2021-11-30 08:39:24.834604"]]

    def set_field
      @field = Field.find(params[:id])
---
SELECT "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]